In [78]:
import numpy as np
import pandas as pd

In [83]:
Data=pd.read_excel( "data.xlsx" , sheet_name = "Answers" )
Data.head()

,Occasion,Type,noGuest,Cooking,Drinks,Sodas,Juice,Beer,Wine,Spirits,Supplies,Decorations,Gathr Kit
0,0,0,2,0,0,0,0,0,0,0,0,0,kit2
1,0,0,2,1,0,0,0,0,0,0,0,0,kit3
2,0,0,2,0,1,0,0,1,0,0,0,0,kit4
3,0,0,2,1,1,1,0,1,0,0,0,0,kit5
4,0,0,5,0,0,0,0,0,0,0,0,0,NaN

In [84]:
Products = pd.read_excel( "data.xlsx" , sheet_name = "Products" )
products_columns = Products.columns
Products.head()

,product_ID,category_ID,category_name,brand,name,price,supplier_name
0,1_00001,1,food,Tostitos,Tortilla Chips,2.98,Duane Reades
1,1_00002,1,food,Old El Paso,Guacamole,1.39,Duane Reades
2,1_00003,1,food,Amy's,Cheese Frozen Pizza,6.69,Duane Reades
3,1_00004,1,food,Piccolo Trattoria,Margherita Pizza,10.95,Piccolo Trattoria
4,1_00005,1,food,Atami,Maki Combo A,16.00,Atami

In [85]:
#inputFormat = [ occasion , Type , noGuest , Cooking , Drinks , Sodas , Juice , Beer , Wine , Spirits , Supplies , Decorations ]

def attribution( input_list ):
    for i in range( len( Data ) ):
        if list(Data.iloc[ i ])[ : -1 ] == input_list:
            kit=Data.iloc[ i ][-1]
    df_kit = pd.read_excel( "data.xlsx" , sheet_name = kit )
    return(df_kit)

In [86]:
input1 = [ 0 , 0 , 2 , 1 , 1 , 1 , 0 , 1 , 0 , 0 , 0 , 0 ]
df1=attribution( input1 )

In [87]:
df1

  product_ID  unit price  quantity
0    2_00001        0.99         1
1    2_00007        1.49         2

In [88]:
for x in df1.product_ID:
    print(x)

2_00001
2_00007

In [90]:
def getKit( kit_df ):
    col = list(products_columns) + ["quantity"]
    kit_elements = pd.DataFrame(columns = col)
    for x in kit_df.product_ID :
        for i in range ( len( Products ) ):
            if Products["product_ID"].iloc[ i ] == x :
                kit_elements = kit_elements.append( Products.iloc[ i ] , ignore_index = True)
    kit_elements["quantity"]=kit_df.quantity
    return( kit_elements )

In [91]:
kit1 = getKit(df1)

In [92]:
kit1

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,2_00001,2_1,sodas,Coca Cola,1.25L bottle,0.99,Duane Reades,1
1,2_00007,2_3,beer,Brooklyn Lager,12fl oz bottle,1.49,Duane Reades,2

In [93]:
def curation ( input_list ):
    if list(Data.iloc[ 0 ])[ : -1 ] == input_list :
        return("your kit is empty, select at least one option to get a Gathr Kit")
    df_kit = attribution ( input_list )
    kit_elements = getKit ( df_kit )
    return ( kit_elements )

In [94]:
curation ( input1 )

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,2_00001,2_1,sodas,Coca Cola,1.25L bottle,0.99,Duane Reades,1
1,2_00007,2_3,beer,Brooklyn Lager,12fl oz bottle,1.49,Duane Reades,2

In [95]:
def create_input( occasion , Type , noGuest , Cooking , Drinks , Supplies , Decorations ):
    input_list = [ occasion , Type , noGuest , Cooking ] + Drinks + [ Supplies , Decorations ]
    return( input_list )

In [96]:
#possible inputs

#Kit2 
occ_2 = 0
typ_2 = 0 
guests_2 = 2
cook_2 = 0
drink_2 = [ 0 , 0 , 0 , 0 , 0 , 0]
supp_2 = 0
decor_2 = 0
input2 = create_input( occ_2 , typ_2 , guests_2 , cook_2 , drink_2 , supp_2 , decor_2 )

#Kit3 
occ_3 = 0
typ_3 = 0 
guests_3 = 2
cook_3 = 1
drink_3 = [ 0 , 0 , 0 , 0 , 0 , 0]
supp_3 = 0
decor_3 = 0
input3 = create_input( occ_3 , typ_3 , guests_3 , cook_3 , drink_3 , supp_3 , decor_3 )

#Kit4 
occ_4 = 0
typ_4 = 0 
guests_4 = 2
cook_4 = 0
drink_4 = [ 1 , 0 , 0 , 1 , 0 , 0]
supp_4 = 0
decor_4 = 0
input4 = create_input( occ_4 , typ_4 , guests_4 , cook_4 , drink_4 , supp_4 , decor_4 )

#Kit5 
occ_5 = 0
typ_5 = 0 
guests_5 = 2
cook_5 = 1
drink_5 = [ 1 , 1 , 0 , 1 , 0 , 0]
supp_5 = 0
decor_5 = 0
input5 = create_input( occ_5 , typ_5 , guests_5 , cook_5 , drink_5 , supp_5 , decor_5 )

In [97]:
curation ( input2 )

'your kit is empty, select at least one option to get a Gathr Kit'

In [98]:
curation ( input3 )

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,1_00001,1,food,Tostitos,Tortilla Chips,2.98,Duane Reades,1
1,1_00002,1,food,Old El Paso,Guacamole,1.39,Duane Reades,1
2,1_00004,1,food,Piccolo Trattoria,Margherita Pizza,10.95,Piccolo Trattoria,1

In [99]:
curation ( input4 )

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,2_00007,2_3,beer,Brooklyn Lager,12fl oz bottle,1.49,Duane Reades,2

In [100]:
curation ( input5 )

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,2_00001,2_1,sodas,Coca Cola,1.25L bottle,0.99,Duane Reades,1
1,2_00007,2_3,beer,Brooklyn Lager,12fl oz bottle,1.49,Duane Reades,2

In [101]:
occ_dic = [ "Casual" , "Holiday" , "Celebration" ]
type_dic = [ [ "Movie Night" , "Dinner Party" , "Brunch" , "Board Game Night" , "Wine and Cheese" , "BBQ"] ,
             [ " Friendsgiving" , "Christmas Party" , "Halloween" , "Galentines Day" , "Dia de los Muertos" , "4th of July"] ,
             [ "Adult Birthday Party" , "Kid Birthday Party", "Graduation" , "Engagment Party" , "Gender Reveal" , "Housewarming"  ] ]

yes_no = [ "No" , "Yes" ]
drinks_options = [ "Sodas" , "Juice" , "Beer" , "Wine" , "Spirits"]


def translate_input( occasion , Type , noGuest , Food , Drinks , Supplies , Decorations ):
    occ = occ_dic.index( occasion )
    typ = type_dic[occ].index( Type )
    guests = noGuest
    cook = yes_no.index( Food )
    drinks = [ yes_no.index( Drinks[0] ) , 0 , 0 , 0 , 0 , 0 ]
    for i in range(len(drinks_options)):
        if drinks_options[i] in Drinks:
            drinks[ i+1 ] = 1
    supp = yes_no.index( Supplies )
    decor = yes_no.index( Decorations )
    
    input_list = create_input( occ , typ , guests , cook , drinks , supp , decor )
    return( input_list )

In [102]:
translate_input( occasion = "Casual" , Type = "Movie Night" , noGuest = 2 , Food = "Yes" , Drinks = ("Yes", "Sodas", "Beer" ) , Supplies = "No" , Decorations = "No" )

[0, 0, 2, 1, 1, 1, 0, 1, 0, 0, 0, 0]

In [104]:
def curation_raw( occasion , Type , noGuest , Food , Drinks , Supplies , Decorations ):
    inp = translate_input( occasion , Type , noGuest , Food , Drinks , Supplies , Decorations )
    return(curation(inp))

In [109]:
curation_raw(occasion = "Casual" , Type = "Movie Night" , noGuest = 2 , Food = "Yes" , Drinks = ["Yes", "Beer", "Sodas"] , Supplies = "No" , Decorations = "No")

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,2_00001,2_1,sodas,Coca Cola,1.25L bottle,0.99,Duane Reades,1
1,2_00007,2_3,beer,Brooklyn Lager,12fl oz bottle,1.49,Duane Reades,2

In [110]:
curation_raw(occasion = "Casual" , Type = "Movie Night" , noGuest = 2 , Food = "No" , Drinks = ["Yes", "Beer"] , Supplies = "No" , Decorations = "No")

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,2_00007,2_3,beer,Brooklyn Lager,12fl oz bottle,1.49,Duane Reades,2

In [111]:
curation_raw(occasion = "Casual" , Type = "Movie Night" , noGuest = 2 , Food = "Yes" , Drinks = ["No"] , Supplies = "No" , Decorations = "No")

,product_ID,category_ID,category_name,brand,name,price,supplier_name,quantity
0,1_00001,1,food,Tostitos,Tortilla Chips,2.98,Duane Reades,1
1,1_00002,1,food,Old El Paso,Guacamole,1.39,Duane Reades,1
2,1_00004,1,food,Piccolo Trattoria,Margherita Pizza,10.95,Piccolo Trattoria,1

In [112]:
curation_raw(occasion = "Casual" , Type = "Movie Night" , noGuest = 2 , Food = "No" , Drinks = ["No"] , Supplies = "No" , Decorations = "No")

'your kit is empty, select at least one option to get a Gathr Kit'